Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionShape
Shapes for structural sections.
Remarks:
Allow safely differentiate between classes inherited from Autodesk::Revit::DB::Structure::StructuralSections::StructuralSection class.
Since:
2015
Since:
2015

Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionShape.ConcreteRound
Defines parameters for ConcreteRound structural sections.

Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionShape.ConcreteCross
Defines parameters for Concrete Cross structural sections.

Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionShape.ConcreteT
Defines parameters for Concrete T structural sections.

Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionShape.ConcreteRectangleCut
Defines parameters for Concrete Rectangle Cut structural sections.

Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionShape.ConcreteRectangle
Defines parameters for Concrete Rectangle structural sections.

Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionShape.UserDefined
Defines parameters for user defines structural sections.

Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionShape.SigmaProfileWithFold
Defines parameters for structural Sigma sections profile with fold.

Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionShape.SigmaProfileWithLips
Defines parameters for structural Sigma sections profile with lips.

Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionShape.SigmaProfile
Defines parameters for Sigma Profile structural sections.

Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionShape.ZProfileWithLips
Defines parameters for structural L profile sections with lips.

Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionShape.ZProfile
Defines parameters for structural Z Profile structural sections.

Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionShape.LProfileWithLips
Defines parameters for structural L Profile sections with lips.

Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionShape.LProfile
Defines parameters for structural L Profile structural sections.

Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionShape.CProfileWithFold
Defines parameters for structural C Profile sections with fold.

Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionShape.CProfileWithLips
Defines parameters for structural C Profile sections with lips  .

Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionShape.CProfile
Defines parameters for structural C Profile sections.

Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionShape.IWelded
Defines parameters for I-shape Welded structural sections.

Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionShape.StructuralTees
Defines parameters for Structural Tees structural sections.

Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionShape.ISplitSlopedFlange
Defines parameters for I-split Sloped Flange structural sections.

Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionShape.ISplitParallelFlange
Defines parameters for I-split Parallel Flange structural sections.

Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionShape.RoundHSS
Defines parameters for Round HSS structural sections.

Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionShape.RectangleHSS
Defines parameters for Rectangular HSS structural sections.

Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionShape.RoundBar
Defines parameters for Round Bar structural sections.

Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionShape.RectangularBar
Defines parameters for Rectangular Bar structural sections.

Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionShape.LAngle
Defines parameters for L-angle structural sections.

Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionShape.CSlopedFlange
Defines parameters for C-channel Sloped Flange structural sections.

Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionShape.CParallelFlange
Defines parameters for C-channel Parallel Flange structural sections.

Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionShape.IWideFlange
Defines parameters for I-shape Wide Flange structural sections.

Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionShape.ISlopedFlange
Defines parameters for I-shape Sloped Flange structural sections.

Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionShape.IParallelFlange
Defines parameters for I-shape Parallel Flange structural sections.

Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionShape.PipeStandard
Defines parameters for pipes also known as RoundHSS or HollowStructuralSection (HSS).

Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionShape.RectangleParameterized
Defines parameters for parameterized rectangle structural sections.

Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionShape.NotDefined
Structural section was not defined for this element

Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionShape.Invalid
This element do not support structural section.